sfjagsf/m-c-x-a-1-7-6/MCXA176_V6.3/board/pin_mux.h
/*! @name PORT1_3 (number 94), SPI0_CS
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI0_CS_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI0_CS_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI0_CS_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_12 (number 5), I2C1_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_I2C1_SDA_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I2C1_SDA_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I2C1_SDA_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT1_13 (number 6), I2C1_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_I2C1_SCL_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I2C1_SCL_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I2C1_SCL_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT3_27 (number 52), I2C3_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_I2C3_SCL_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I2C3_SCL_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I2C3_SCL_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT3_29 (number 50), IO3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_IO3_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_IO3_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_IO3_GPIO_PIN 29U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_IO3_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_IO3_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_IO3_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_IO3_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT3_30 (number 49), IO1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_IO1_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_IO1_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_IO1_GPIO_PIN 30U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_IO1_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_IO1_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_IO1_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_IO1_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT3_28 (number 51), I2C3_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_I2C3_SDA_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I2C3_SDA_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I2C3_SDA_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT0_23 (number 90), EN_15V
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EN_15V_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EN_15V_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_EN_15V_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_EN_15V_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_EN_15V_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EN_15V_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EN_15V_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_31 (number 11), OSC_IN
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OSC_IN_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OSC_IN_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OSC_IN_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_30 (number 10), OSC_OUT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OSC_OUT_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OSC_OUT_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OSC_OUT_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT3_17 (number 58), IN5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_IN5_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_IN5_GPIO_PIN 17U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_IN5_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_IN5_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_IN5_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_IN5_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT3_18 (number 57), IN1
  @{ */

